base/Catalogs/бит_ПользовательскиеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Comment>Код условия на внутреннем языке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстВыполнения</Name>
					<Comment>Контекст выполнения пользовательского условия</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Comment>Алгоритм</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПользовательскогоУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкобкаНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкобкаКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединениеСПоследующим</Name>
							<Comment>Объединение с последующим</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипыОбъединенияУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Это выражение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловий</Name>
					<Comment>Параметры условий</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД_Условия</Name>
							<Comment>Идентификатор условия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Comment>Дополнительные параметры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолеваяАдресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСписковУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыСравненияТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСравненияТрансляции</Name>
			<Comment>Виды сравнения трансляции</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппе</Name>
					<Comment>В группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НЕВГруппе</Name>
					<Comment>НЕ в группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ПользовательскиеУсловия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Фиксированные параметры проверки условия подключаемого алгоритма.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НовыеПараметрыПроверкиПодключаемогоАлгоритма() Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ОбъектПроверки");
	ПараметрыПроверки.Вставить("ПользовательскоеУсловие");
	
	Возврат ПараметрыПроверки;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбщиеТабличныеЧастиСпискаОбъектов(СписокОбъектов) Экспорт
	
	Если СписокОбъектов.Количество() = 0 Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	ОбъединенныйСписок = Новый СписокЗначений;
	
	ПорядокОбъекта = 1;
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		ОбъектСистемы         = ЭлементСписка.Значение;
		СписокТабличныхЧастей = СформироватьСписокТабЧастей(ОбъектСистемы);
		Если СписокТабличныхЧастей.Количество() = 0 Тогда
			Возврат Новый СписокЗначений;
		КонецЕсли;
		Если ПорядокОбъекта = 1 Тогда
			ОбъединенныйСписок = СписокТабличныхЧастей;
		Иначе
			Для Индекс = 1 - ОбъединенныйСписок.Количество() По 0 Цикл
			    ЭлементОбъединенногоСписка = ОбъединенныйСписок.Получить(-Индекс);
				ИмяТЧОбъединенногоСписка   = ЭлементОбъединенногоСписка.Значение;
			    Если СписокТабличныхЧастей.НайтиПоЗначению(ИмяТЧОбъединенногоСписка) = Неопределено Тогда
			        ОбъединенныйСписок.Удалить(ЭлементОбъединенногоСписка);
				КонецЕсли;
			КонецЦикла;
			Если ОбъединенныйСписок.Количество() = 0 Тогда
				Возврат Новый СписокЗначений;
			КонецЕсли;
		КонецЕсли;
		ПорядокОбъекта = ПорядокОбъекта + 1;
	КонецЦикла;
	
	Возврат ОбъединенныйСписок;
	
КонецФункции

Функция ОбщиеРеквизитыТабличныхЧастей(СписокОбъектов, ИмяТабличнойЧасти) Экспорт
	
	Если СписокОбъектов.Количество() = 0 Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	ОбъединенныйСписок = Новый СписокЗначений;
	
	ПорядокОбъекта = 1;
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		ОбъектСистемы    = ЭлементСписка.Значение;
		СписокРеквитовТЧ = СформироватьСписокРеквизитовТабЧасти(ОбъектСистемы, ИмяТабличнойЧасти);
		Если СписокРеквитовТЧ.Количество() = 0 Тогда
			Возврат Новый СписокЗначений;
		КонецЕсли;
		Если ПорядокОбъекта = 1 Тогда
			ОбъединенныйСписок = СписокРеквитовТЧ;
		Иначе
			Для Индекс = 1 - ОбъединенныйСписок.Количество() По 0 Цикл
			    ЭлементОбъединенногоСписка = ОбъединенныйСписок.Получить(-Индекс);
				ИмяТЧОбъединенногоСписка   = ЭлементОбъединенногоСписка.Значение;
			    Если СписокРеквитовТЧ.НайтиПоЗначению(ИмяТЧОбъединенногоСписка) = Неопределено Тогда
			        ОбъединенныйСписок.Удалить(ЭлементОбъединенногоСписка);
				КонецЕсли;
			КонецЦикла;
			Если ОбъединенныйСписок.Количество() = 0 Тогда
				Возврат Новый СписокЗначений;
			КонецЕсли;
		КонецЕсли;
		ПорядокОбъекта = ПорядокОбъекта + 1;
	КонецЦикла;
	
	Возврат ОбъединенныйСписок;
	
КонецФункции

// Функция вычисляет значение пользовательского условия.
// 
// Параметры:
//  ПользовательскоеУсловие  - СправочникСсылка.бит_ПользовательскиеУсловия.
//  СтруктураКонтекст        - Структура.
//  ВыражениеКорректно       - Булево - признак того, что выражения условия корректно.
//  Заголовок      - Строка
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
// 
// Возвращаемое значение:
//   флРезультат   - Булево
// 
Функция ПроверитьПользовательскоеУсловие(ПользовательскоеУсловие
	                                      ,СтруктураКонтекст
										  ,ВыражениеКорректно = Истина
										  ,Заголовок = ""
										  ,РежимСообщений = "Ошибки") Экспорт

	Результат = Ложь;
	
	Если ПользовательскоеУсловие = Неопределено
		ИЛИ ПользовательскоеУсловие = Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка() Тогда
		Возврат Результат;
	КонецЕсли;
											  
	УстановитьПривилегированныйРежим(Истина);									  
	
	ПараметрыПроверки = ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие, СтруктураКонтекст);
	Если НЕ ПараметрыПроверки.УсловиеПодходитТекущемуОбъекту Тогда
		Возврат Результат;
	КонецЕсли;
	КодУсловия = ПараметрыПроверки.КодУсловия;
	
	ВыражениеКорректно = Истина;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	// Заполнение соответствие значений. 
	Значения = Новый Соответствие;
	Для каждого СтрокаТаблицы Из ПользовательскоеУсловие.Условия Цикл
		Значения.Вставить(СтрокаТаблицы.ИД, СтрокаТаблицы.Значение);
	КонецЦикла;
	СоответствиеСписков = ЗначенияСписковУсловийПоИдентификаторам(ПользовательскоеУсловие);
	Для каждого ЭлементСоответствия Из СоответствиеСписков Цикл
		Значения.Вставить(ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение);
	КонецЦикла;
	СтруктураКонтекст.Вставить("ЗначенияПользовательскихУсловий", Значения);
	
	
	// Заполнение параметров условия
	ПараметрыУсловия = Новый Структура;
	Для каждого ТекущаяСтрока Из ПользовательскоеУсловие.ДополнительныеПараметры Цикл
		ПараметрыУсловия.Вставить(ТекущаяСтрока.Имя, ТекущаяСтрока.Значение);
	КонецЦикла; 
	
	// Дополнение контекста динамически вычисляемыми своствами.
	ДополнитьКонтекст(ПользовательскоеУсловие, СтруктураКонтекст);
	
	// Вычисление значений функций работы с визами, ТабЧастьСодержитЗначение, СостояниеЗадачи.
	ВычислитьЗначенияПредопределенныхФункций(ПользовательскоеУсловие, СтруктураКонтекст);
	
	// Проверочный вариант кода условия
	Если СтруктураКонтекст.Свойство("КодУсловияПроверочный") Тогда
		КодУсловия = СтруктураКонтекст.КодУсловияПроверочный;
	КонецЕсли; 
	
	// Вычисление условия
	Статус = Неопределено;
	СтруктураКонтекст.Свойство("Статус", Статус);
	Попытка			
		// АПК:488-выкл. ВычислитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
		Результат = Вычислить(КодУсловия);
		// АПК:488-вкл.
	Исключение
		ВыражениеКорректно = Ложь;
		Если ВыводитьОшибки Тогда
			КодУсловияПредставление = СформироватьПредставлениеКодаПользовательскогоУсловия(ПользовательскоеУсловие.Условия, 
																							КодУсловия);				
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка: %1
											|Код условия: %2'; 
											|en = 'Error: %1
											|Condition Code: %2'"), 
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
										КодУсловияПредставление);								 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПользовательскоеУсловие);
		КонецЕсли; 
	КонецПопытки;
	
	Если СтруктураКонтекст.Свойство("УстановленныеВизы") Тогда
		 СтруктураКонтекст.Удалить("УстановленныеВизы");
	КонецЕсли; 
	 
	Если СтруктураКонтекст.Свойство("ОплатаЗаявки") Тогда
		 СтруктураКонтекст.Удалить("ОплатаЗаявки");
	КонецЕсли;  

	УстановитьПривилегированныйРежим(Ложь);									  
	
	Возврат Результат;
	
КонецФункции

// Функция формирует представление пользовательского условия.
// ИД значений заменяются на представления.
// 
// Параметры:
//  ПользовательскоеУсловие  - СправочникСсылка.бит_ПользовательскиеУсловия.
//  Значения  - Соответствие.
// 
// Возвращаемое значение:
//   СтрРезультат   - Строка.
// 
Функция СформироватьПредставлениеКодаПользовательскогоУсловия(ТаблицаУсловия,КодУсловия) Экспорт
	
	СтрРезультат = КодУсловия;
	Для Каждого СтрокаТаблицы Из ТаблицаУсловия Цикл
		СтрКЗамене = "Значения["""+СтрокаТаблицы.ИД+"""]";
		СтрРезультат = СтрЗаменить(СтрРезультат,СтрКЗамене,""""+Строка(СтрокаТаблицы.Значение)+"""");
	КонецЦикла; 
	
	Возврат СтрРезультат;
	
КонецФункции
	
// Функция формирует список реквизитов.
//
// Параметры:
//  ТекОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//  ИмяТабЧасти      - Строка
//
// Возвращаемое значение:
//  Результат - Строка.
//
Функция СформироватьСписокРеквизитовПозиции(ТекОбъектСистемы) Экспорт

	Если НЕ бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезСписок = Неопределено;
	
	Если ТипЗнч(ТекОбъектСистемы) = Тип("СписокЗначений") Тогда
		
		СписокОбщихРеквизитов = Новый СписокЗначений;
		ТипыРеквизитов        = Новый Соответствие;
		ЭтоПервыйЭлемент      = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_ОбъектыСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное
		|ИЗ
		|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
		|ГДЕ
		|	бит_ОбъектыСистемы.Ссылка В(&ОбъектыСистемы)";
		Запрос.УстановитьПараметр("ОбъектыСистемы", ТекОбъектСистемы);
		ВыборкаИменОбъектов = Запрос.Выполнить().Выбрать();
		Пока ВыборкаИменОбъектов.Следующий() Цикл
			
			СтруктураИмениИсточника = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ВыборкаИменОбъектов.ИмяОбъектаПолное);
			МодульВизирование       = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
			ИмяОбъектаПозиции       = МодульВизирование.ИмяПозиций(СтруктураИмениИсточника.ИмяОбъекта);
			МетаОбъект = Метаданные[СтруктураИмениИсточника.ИмяКоллекции][ИмяОбъектаПозиции];
			
			СписокТекущихРеквизитов = Новый СписокЗначений;
			
			Для каждого Реквизит Из МетаОбъект.СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Ссылка" Тогда
					Продолжить;				
				КонецЕсли;
				СписокТекущихРеквизитов.Добавить(Реквизит.Имя);
				ТипыРеквизитов.Вставить(Реквизит.Имя, Реквизит.Тип); 
			КонецЦикла;
			
			Для каждого Реквизит Из МетаОбъект.Реквизиты Цикл
				СписокТекущихРеквизитов.Добавить(Реквизит.Имя);
				ТипыРеквизитов.Вставить(Реквизит.Имя, Реквизит.Тип); 
			КонецЦикла;
				
			Если ОбщегоНазначения.ЭтоЗадача(МетаОбъект) Тогда
				Реквизит = МетаОбъект.РеквизитыАдресации.Найти("Исполнитель");
				Если Реквизит <> Неопределено Тогда
					СписокТекущихРеквизитов.Добавить(Реквизит.Имя);
					ТипыРеквизитов.Вставить(Реквизит.Имя, Реквизит.Тип); 
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоПервыйЭлемент Тогда
				СписокОбщихРеквизитов = СписокТекущихРеквизитов;
			Иначе
				Для Индекс = 1 - СписокОбщихРеквизитов.Количество() По 0 Цикл
					ЭлементОбъединенногоСписка  = СписокОбщихРеквизитов.Получить(-Индекс);
					РеквизитОбъединенногоСписка = ЭлементОбъединенногоСписка.Значение;
					Если СписокТекущихРеквизитов.НайтиПоЗначению(РеквизитОбъединенногоСписка) = Неопределено Тогда
						СписокОбщихРеквизитов.Удалить(ЭлементОбъединенногоСписка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ЭтоПервыйЭлемент = Ложь;
			
		КонецЦикла;
		
		РезСписок = Новый СписокЗначений;
		Для каждого ЭлементОбъединенногоСпискащегоРеквизита Из СписокОбщихРеквизитов Цикл
			ИмяРеквизита = ЭлементОбъединенногоСпискащегоРеквизита.Значение; 
			ТипЭлемента  = ТипыРеквизитов.Получить(ИмяРеквизита);
			РезСписок.Добавить(ТипЭлемента, ИмяРеквизита);
		КонецЦикла;
		
		РезСписок.СортироватьПоПредставлению();
			
		
	ИначеЕсли ЗначениеЗаполнено(ТекОбъектСистемы) Тогда
		
		РезСписок = Новый СписокЗначений;
		
		СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ТекОбъектСистемы.ИмяОбъектаПолное);
		
		МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
		ИмяПоз      = МодульВизирование.ИмяПозиций(СтрИмен.ИмяОбъекта);
		
		МетаОбъект = Метаданные[СтрИмен.ИмяКоллекции][ИмяПоз];
		
		Для каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
			РезСписок.Добавить(МетаРеквизит.Тип, МетаРеквизит.Имя);
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат РезСписок;
	
КонецФункции

// Заполняет табличную часть РолеваяАдресация и вид пользовательского условия
//  в соответствии со значениями ТЧ Условия.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.бит_ПользовательскиеУсловия
//
Процедура АктуализироватьДанныеРолевойАдресации(ТекущийОбъект) Экспорт
	
	ТЧРолеваяАдресация = ТекущийОбъект.РолеваяАдресация;
	ТЧРолеваяАдресация.Очистить();
	
	ЕстьУсловияРолевойАдресации = Ложь;
	ЕстьПрочиеУсловия           = Ложь;
	Для каждого СтрокаУсловия Из ТекущийОбъект.Условия Цикл
		Если СтрокаУсловия.Свойство = "Прочее.ДоступнаРольИсполнителя"
			ИЛИ СтрокаУсловия.Свойство = "Прочее.НазначеныИсполнители" Тогда
			РольИсполнителя = ПолучитьПараметрУсловия(ТекущийОбъект.ПараметрыУсловий
														,СтрокаУсловия.ИД
														,"Роль"
														,Неопределено);
			Если ЗначениеЗаполнено(РольИсполнителя) Тогда
				СтрокаАдресации = ТЧРолеваяАдресация.Добавить();
				СтрокаАдресации.РольИсполнителя = РольИсполнителя;
				ЕстьУсловияРолевойАдресации     = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ЕстьПрочиеУсловия = Истина;
	КонецЦикла;
	
	Если ЕстьУсловияРолевойАдресации И ЕстьПрочиеУсловия Тогда
		ВидУсловия = Перечисления.бит_ВидыПользовательскихУсловий.Смешанный;
	ИначеЕсли ЕстьУсловияРолевойАдресации Тогда
		ВидУсловия = Перечисления.бит_ВидыПользовательскихУсловий.РолеваяАдресация;
	Иначе
		ВидУсловия = Перечисления.бит_ВидыПользовательскихУсловий.Прочее;
	КонецЕсли;
	
	ТекущийОбъект.ВидПользовательскогоУсловия = ВидУсловия;
	
КонецПроцедуры

// Функция получает значение параметра пользовательского условия.
// 
// Параметры:
//  ПараметрыУсловий  - ТабличнаяЧасть.
//  ИД_Условия  - Строка.
//  Имя         - Строка.
//  ЗначениеПоУмолчанию - Произвольный.
// 
// Возвращаемое значение:
//   ПараметрУсловия   - Произвольный.
// 
// АПК:581-выкл процедура экспортная, используется в функционале ЕРП.
Функция ПолучитьПараметрУсловия(ПараметрыУсловий,ИД_Условия,Имя,ЗначениеПоУмолчанию) Экспорт
// АПК:581-вкл

	СтрОтбор    = Новый Структура("ИД_Условия,Имя",ИД_Условия,Имя);
	МассивСтрок = ПараметрыУсловий.НайтиСтроки(СтрОтбор);
	Если МассивСтрок.Количество()>0 Тогда
		ПараметрУсловия = МассивСтрок[0].Значение;
	Иначе	 
		ПараметрУсловия = ЗначениеПоУмолчанию;
	КонецЕсли; 

	Возврат ПараметрУсловия;
	
КонецФункции

// Служебный вызов серверной функции, см. бит_ВизированиеПовтИсп.ПараметрыПроверкиПользовательскогоУсловия().
//
Функция ПараметрыПроверкиСсылкиПользовательскогоУсловия(ПользовательскоеУсловие, ИмяПроверяемогоОбъекта) Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("КодУсловия"                    , "");
	ПараметрыПроверки.Вставить("УсловиеПодходитТекущемуОбъекту", Истина);
	
	ПараметрыПроверки.КодУсловия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательскоеУсловие, "КодУсловия");
	
	ПроверятьОбъектСистемы = Истина;
	Если бит_ОбщегоНазначения.ЭтоСемействоERP()
		И (ИмяПроверяемогоОбъекта = "Документ.бит_кзн_ПлатежнаяПозиция"
		ИЛИ ИмяПроверяемогоОбъекта = "Документ.бит_кзн_ПозицияПоступления") Тогда
		ПроверятьОбъектСистемы = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	УсловияПользовательскогоУсловия.Ссылка КАК Ссылка,
		|	ПОДСТРОКА(УсловияПользовательскогоУсловия.Свойство, 1, 50) КАК СвойствоУсловия
		|ПОМЕСТИТЬ ПользовательскиеУсловия
		|ИЗ
		|	Справочник.бит_ПользовательскиеУсловия.Условия КАК УсловияПользовательскогоУсловия
		|ГДЕ
		|	УсловияПользовательскогоУсловия.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПользовательскиеУсловия.Ссылка КАК Ссылка,
		|	ПользовательскиеУсловия.СвойствоУсловия КАК СвойствоУсловия
		|ИЗ
		|	ПользовательскиеУсловия КАК ПользовательскиеУсловия
		|ГДЕ
		|	ПользовательскиеУсловия.СвойствоУсловия = ""Прочее.ДоступнаРольИсполнителя""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПользовательскиеУсловия.Ссылка,
		|	ПользовательскиеУсловия.СвойствоУсловия
		|ИЗ
		|	ПользовательскиеУсловия КАК ПользовательскиеУсловия
		|ГДЕ
		|	ПользовательскиеУсловия.СвойствоУсловия = ""Прочее.НазначеныИсполнители""";
		Запрос.УстановитьПараметр("Ссылка", ПользовательскоеУсловие);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ПроверятьОбъектСистемы = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьОбъектСистемы Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыПользовательскогоУсловия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_ПользовательскиеУсловия.ОбъектыСистемы КАК ОбъектыПользовательскогоУсловия
		|ГДЕ
		|	ОбъектыПользовательскогоУсловия.Ссылка = &Ссылка
		|	И ОбъектыПользовательскогоУсловия.ОбъектСистемы = &ОбъектСистемы";
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяПроверяемогоОбъекта);
		Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
		Если Запрос.Выполнить().Пустой() Тогда
			ПараметрыПроверки.УсловиеПодходитТекущемуОбъекту = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ПараметрыПроверки;
	
КонецФункции

Функция ЗначенияСписковУсловийПоИдентификаторам(ТекущийОбъект) Экспорт
	
	СоответствиеСписков = Новый Соответствие;
	Для каждого СтрокаЗначения Из ТекущийОбъект.ЗначенияСписковУсловий Цикл
		ИдентификаторУсловия = СтрокаЗначения.ИдентификаторУсловия;
		Если НЕ ПустаяСтрока(СтрокаЗначения.ИмяПараметра) Тогда
			ИдентификаторУсловия = СтрШаблон("%1_%2", СокрЛП(СтрокаЗначения.ИмяПараметра), ИдентификаторУсловия);
		КонецЕсли;
		ЗначенияУсловия      = СоответствиеСписков.Получить(ИдентификаторУсловия);
		Если ЗначенияУсловия = Неопределено Тогда
			ЗначенияУсловия = Новый СписокЗначений;
		КонецЕсли;
		ЗначенияУсловия.Добавить(СтрокаЗначения.Значение);
		СоответствиеСписков.Вставить(ИдентификаторУсловия, ЗначенияУсловия);
	КонецЦикла;
	
	Возврат СоответствиеСписков;
	
КонецФункции

#КонецОбласти 	

#Область СлужебныеПроцедурыИФункции

// Функция формирует список табличных частей данного объекта системы.
// 
// Параметры:
//  ТекОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//  СписокТабЧастей - СписокЗначений.
// 
Функция СформироватьСписокТабЧастей(ТекОбъектСистемы)
	
	СписокТабЧастей = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ТекОбъектСистемы) Тогда
	    СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ТекОбъектСистемы.ИмяОбъектаПолное);
		МетаОбъект = Метаданные[СтрИмен.ИмяКоллекции][СтрИмен.ИмяОбъекта];
		Для Каждого МетаТабЧасть Из МетаОбъект.ТабличныеЧасти Цикл
			СписокТабЧастей.Добавить(МетаТабЧасть.Имя, МетаТабЧасть.Имя);
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат СписокТабЧастей;
	
КонецФункции
	
// Функция формирует список реквизитов.
// 
// Параметры:
//  ТекОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
//  ИмяТабЧасти      - Строка - имя таблицы.
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция СформироватьСписокРеквизитовТабЧасти(ТекОбъектСистемы, ИмяТабЧасти)

	РезСписок = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ТекОбъектСистемы) Тогда
		СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ТекОбъектСистемы.ИмяОбъектаПолное);
		МетаОбъект = Метаданные[СтрИмен.ИмяКоллекции][СтрИмен.ИмяОбъекта];
		МетаТабЧасть = МетаОбъект.ТабличныеЧасти.Найти(ИмяТабЧасти);
		Если НЕ МетаТабЧасть = Неопределено Тогда
			 Для Каждого МетаРеквизит Из МетаТабЧасть.Реквизиты Цикл
			 	  РезСписок.Добавить(МетаРеквизит.Тип, МетаРеквизит.Имя);
			 КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 

	Возврат РезСписок;
	
КонецФункции

// Функция определяет какой объект необходимо передавать в функцию для проверки.
//
// Параметры:
//   ТекущийОбъект - ДокументОбъект
//
// Возвращаемое значение:
//  ОбъектПроверки - Произвольный.
//
Функция ОпределитьОбъектПроверки(ТекущийОбъект)

	МетаОбъект = ТекущийОбъект.Метаданные();
	
	Если МетаОбъект.Имя = "бит_кзн_ПлатежнаяПозиция" 
		ИЛИ МетаОбъект.Имя = "бит_кзн_ПозицияПоступления" Тогда
		
		ОбъектПроверки = ТекущийОбъект.ДокументПланирования;
	Иначе	
		ОбъектПроверки = ТекущийОбъект.Ссылка;
	КонецЕсли; 											
	
	Возврат ОбъектПроверки;
	
КонецФункции

// Процедура дополняет контекст вычисления пользовательского условия динамически вычисляемыми значениями.
// 
// Параметры:
//  ПользовательскоеУсловие   - СправочникСсылка.бит_ПользовательскиеУсловия.
//  СтруктураКонтекст         - Структура.
// 
Процедура ДополнитьКонтекст(ПользовательскоеУсловие, СтруктураКонтекст)
    
    КодУсловия = ПользовательскоеУсловие.КодУсловия;
    
	// Заполним статус.
    Если НЕ СтруктураКонтекст.Свойство("Статус") И Найти(КодУсловия, "Статус") <> 0 Тогда
		// Получаем статус и дату изменения статуса для документа.
		Статус = бит_ВизированиеСервер.ТекущийСтатус(СтруктураКонтекст.ТекущийОбъект.Ссылка);
        СтруктураКонтекст.Вставить("Статус", Статус);
	КонецЕсли; 
	
	// Заполним структуру прочее.
	Если НЕ СтруктураКонтекст.Свойство("Прочее") Тогда
		СтруктураПрочее = Новый Структура;
		Если СтруктураКонтекст.Свойство("ТекущийПользователь") Тогда
			СтруктураПрочее.Вставить("ТекущийПользователь", СтруктураКонтекст.ТекущийПользователь);
		Иначе	
			СтруктураПрочее.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
		КонецЕсли; 
        СтруктураКонтекст.Вставить("Прочее", СтруктураПрочее);
	КонецЕсли; 
	
	ДополнитьКонтекстПроцесса(СтруктураКонтекст, ПользовательскоеУсловие);
	
	МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	МодульВизирование.ДополнитьКонтекстПользовательскогоУсловия(ПользовательскоеУсловие, СтруктураКонтекст);
	
КонецПроцедуры

Процедура ДополнитьКонтекстПроцесса(СтруктураКонтекст, ПользовательскоеУсловие)
	
	ТекущийОбъект      = СтруктураКонтекст.ТекущийОбъект;
	ТипТекущегоОбъекта = ТипЗнч(ТекущийОбъект);
	Если ТипТекущегоОбъекта <> Тип("БизнесПроцессОбъект.бит_Процесс") 
		И ТипТекущегоОбъекта <> Тип("БизнесПроцессСсылка.бит_Процесс") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяДополнитьСвойствоКонтекста(СтруктураКонтекст, ПользовательскоеУсловие, "ПараметрыПроцесса") Тогда
		СтрПараметрыПроцесса = Новый Структура;
		Для каждого СтрокаТаблицы Из СтруктураКонтекст.ТекущийОбъект.ПараметрыПроцесса Цикл				
			СтрПараметрыПроцесса.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение); 				
		КонецЦикла; 
		СтруктураКонтекст.Вставить("ПараметрыПроцесса", СтрПараметрыПроцесса);
	КонецЕсли;
	
КонецПроцедуры
	
Функция ТребуетсяДополнитьСвойствоКонтекста(СтруктураКонтекст, ПользовательскоеУсловие, Свойство)
	
	Если ПустаяСтрока(Свойство) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтруктураКонтекст.Свойство(Свойство) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтекстноеУсловие = "СтруктураКонтекст." + Свойство;
	Возврат Найти(ПользовательскоеУсловие.КодУсловия, КонтекстноеУсловие) <> 0;
	
КонецФункции

// Процедура вычисляет значения функций, использованных в пользовательском условии.
// 
// Параметры:
//  ПользовательскоеУсловие  - СправочникСсылка.бит_ПользовательскиеУсловия.
//  СтруктураКонтекст         - Структура.
// 
Процедура ВычислитьЗначенияПредопределенныхФункций(ПользовательскоеУсловие, СтруктураКонтекст)
	
	УстановленныеВизы        = Новый Соответствие;
	СостояниеЗадачи          = Новый Соответствие;
	ЗадачиПроцесса           = Новый Соответствие;
	ТабЧастьСодержитЗначение = Новый Соответствие;
	ДоступнаРольИсполнителя  = Новый Соответствие;
	НазначеныИсполнители     = Новый Соответствие;
	ЕстьКорректировкаКонтрольныхЗначений = Новый Соответствие;
	ВключенаВРеестр            = Новый Соответствие;
	РеестрОплачен              = Новый Соответствие;
	РеестрЧастичноОплачен      = Новый Соответствие;
	ПозСодержитЗначениеВГруппе = Новый Соответствие;
	СуммаПозиций               = Новый Соответствие;
	ПозСодержитЗначение        = Новый Соответствие;
	ПодключаемыеАлгоритмы      = Новый Соответствие;
	РезультатПроверкиПозиций   = Новый Соответствие;
	
	Если СтруктураКонтекст.Свойство("НаборВизы") Тогда
		НаборВизы = СтруктураКонтекст.НаборВизы;
	Иначе
		НаборВизы = Неопределено;
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ПользовательскоеУсловие.Условия Цикл
		
		Если СтрокаТаблицы.Свойство = "СостояниеЗадачи" Тогда
			Точка  = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
											,СтрокаТаблицы.ИД
											,"Точка"
											,Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка());
											
			Если СтруктураКонтекст.Свойство("ТекущаяТочка")
				И СтруктураКонтекст.ТекущаяТочка = Точка Тогда
				// Проверка вызывается в момент выполнения задачи по текущей точки.
				// Новое состояние еще не зафиксировано.
				Состояние = Справочники.бит_СтатусыОбъектов.Задача_Выполнена;
			Иначе
				Состояние = Задачи.бит_Задача.СостояниеЗадачиВТочке(Точка, СтруктураКонтекст.ТекущийОбъект.Ссылка);
			КонецЕсли;
			СостояниеЗадачи.Вставить(СтрокаТаблицы.ИД,Состояние);
			
		ИначеЕсли СтрНачинаетсяС(СтрокаТаблицы.Свойство, "ТекущаяЗадача.") Тогда
			
			Точка = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий, СтрокаТаблицы.ИД, "Точка",
											Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка());
			ТекущаяЗадача = Задачи.бит_Задача.НайтиЗадачу(СтруктураКонтекст.ТекущийОбъект.Ссылка, Точка);
			ЗадачиПроцесса.Вставить(СтрокаТаблицы.ИД, ТекущаяЗадача);
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ТабЧастьСодержитЗначение" Тогда
			РезультатПроверки = РезультатУсловияТабЧастьСодержитЗначение(СтрокаТаблицы, ПользовательскоеУсловие,
																			СтруктураКонтекст);
			ТабЧастьСодержитЗначение.Вставить(СтрокаТаблицы.ИД, РезультатПроверки);
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ПозицияСодержитЗначение" Тогда
			
			Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
				МодульВизирование.ПользовательскоеУсловиеПозицияСодержитЗначение(ПозСодержитЗначение,
																			ПользовательскоеУсловие,
																			СтрокаТаблицы,
																			СтруктураКонтекст);
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ПозицияСодержитЗначениеВГруппе" Тогда
			
			Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
				МодульВизирование.ПользовательскоеУсловиеПозицияСодержитЗначениееВГруппе(ПозСодержитЗначениеВГруппе,
																			ПользовательскоеУсловие,
																			СтрокаТаблицы,
																			СтруктураКонтекст);
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.СуммаПозиций" Тогда
			
			Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
				МодульВизирование.ПользовательскоеУсловиеСуммаПозиций(СуммаПозиций, СтрокаТаблицы, СтруктураКонтекст);
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ДоступнаРольИсполнителя" Тогда
			
			ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
														,СтрокаТаблицы.ИД
														,"Роль"
														,Справочники.бит_РолиИсполнителей);
														
			ТекПользователь = Неопределено;
			СтруктураКонтекст.Свойство("ТекущийПользователь", ТекПользователь);
			
			Если ЗначениеЗаполнено(СтруктураКонтекст.ТекущийОбъект.Ссылка)  Тогда
				ДоступнаРольИсполнителя[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ДоступнаРольИсполнителя(СтруктураКонтекст.ТекущийОбъект.Ссылка
																								,ПараметрУсловия
																								,ТекПользователь);
			Иначе	
				ДоступнаРольИсполнителя[СтрокаТаблицы.ИД] = Ложь;
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.НазначеныИсполнители" Тогда
			
			ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
														,СтрокаТаблицы.ИД
														,"Роль"
														,Справочники.бит_РолиИсполнителей);
														
			Если ЗначениеЗаполнено(СтруктураКонтекст.ТекущийОбъект.Ссылка)  Тогда
				НазначеныИсполнители[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.НазначеныИсполнители(СтруктураКонтекст.ТекущийОбъект.Ссылка
																								,ПараметрУсловия);
			Иначе	
				НазначеныИсполнители[СтрокаТаблицы.ИД] = Ложь;
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ЕстьКорректировкаКонтрольныхЗначений" Тогда
			
			ЕстьКорректировка = бит_КонтрольИсполненияБюджета.ЕстьКорректировкаКонтрольныхЗначений(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			ЕстьКорректировкаКонтрольныхЗначений.Вставить(СтрокаТаблицы.ИД, ЕстьКорректировка);
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ВключенаВРеестр" Тогда
			
			РезультатВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(СтруктураКонтекст.ТекущийОбъект.Ссылка);
			ВключенаВРеестр.Вставить(СтрокаТаблицы.ИД, РезультатВключенаВРеестр);
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.РеестрОплачен" Тогда
			
			ИмяРеестраПлатежей = бит_ОбщегоНазначения.ИмяРеестраПлатежей();
			СостояниеОплатыРеестра = Документы[ИмяРеестраПлатежей].СостояниеОплаты(СтруктураКонтекст.ТекущийОбъект);
			РеестрОплачен.Вставить(СтрокаТаблицы.ИД, СостояниеОплатыРеестра.РеестрОплачен);
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.РеестрЧастичноОплачен" Тогда
			
			ИмяРеестраПлатежей = бит_ОбщегоНазначения.ИмяРеестраПлатежей();
			СостояниеОплатыРеестра = Документы[ИмяРеестраПлатежей].СостояниеОплаты(СтруктураКонтекст.ТекущийОбъект);
			РеестрЧастичноОплачен.Вставить(СтрокаТаблицы.ИД, СостояниеОплатыРеестра.РеестрЧастичноОплачен);
			
		ИначеЕсли СтрокаТаблицы.Свойство = "Прочее.ПодключаемыйАлгоритм" Тогда

			ПодключаемыеАлгоритмы[СтрокаТаблицы.ИД] = РезультатПроверкиУсловияПодключаемогоАлгоритма(СтрокаТаблицы.Значение,
														ПользовательскоеУсловие, СтруктураКонтекст);
														
		ИначеЕсли СтрНачинаетсяС(СтрокаТаблицы.Свойство, "РеквизитыПозиции.")
			ИЛИ (СтрНачинаетсяС(СтрокаТаблицы.Свойство, "ЗначениеЗаполнено(РеквизитыПозиции.")
				И СтрЗаканчиваетсяНа(СтрокаТаблицы.Свойство, ")")) Тогда
				
			Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
				МодульВизирование.ПроверитьПозициюПользовательскогоУсловия(РезультатПроверкиПозиций, СтрокаТаблицы,
																			СтруктураКонтекст);
			КонецЕсли;
			
		ИначеЕсли Найти(СтрокаТаблицы.Свойство,"УстановленныеВизы")>0 Тогда
			
			Если СтрокаТаблицы.Свойство = "УстановленныеВизы.ВсеВизыПолучены" Тогда
				
				Если УстановленныеВизы["ВсеВизыПолучены"] = Неопределено Тогда
					
					ОбъектПроверки = ОпределитьОбъектПроверки(СтруктураКонтекст.ТекущийОбъект);
					УстановленныеВизы["ВсеВизыПолучены"] = бит_ВизированиеСервер.ВизыПолучены(ОбъектПроверки);
					
				КонецЕсли; 
				
			ИначеЕсли СтрокаТаблицы.Свойство = "УстановленныеВизы.ПринятоРешение" Тогда
				
				ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
															,СтрокаТаблицы.ИД
															,"Решение"
															,Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка());
															
				ОбъектПроверки = ОпределитьОбъектПроверки(СтруктураКонтекст.ТекущийОбъект);
				УстановленныеВизы[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ПринятоРешение(ОбъектПроверки
																					,ПараметрУсловия
																					,НаборВизы);
				
			ИначеЕсли СтрокаТаблицы.Свойство = "УстановленныеВизы.ПринятоРешениеПоВизе" Тогда	
				
				ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
															,СтрокаТаблицы.ИД
															,"Виза"
															,Справочники.бит_Визы.ПустаяСсылка());
															
				ОбъектПроверки = ОпределитьОбъектПроверки(СтруктураКонтекст.ТекущийОбъект);
				УстановленныеВизы[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ПринятоРешениеПоВизе(ОбъектПроверки
																							,ПараметрУсловия
																							,НаборВизы);
				
			ИначеЕсли СтрокаТаблицы.Свойство = "УстановленныеВизы.ПринятыРешенияПоВышестоящимВизам" Тогда	
				
				ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
															,СтрокаТаблицы.ИД
															,"Виза"
															,Справочники.бит_Визы.ПустаяСсылка());
															
				ОбъектПроверки = ОпределитьОбъектПроверки(СтруктураКонтекст.ТекущийОбъект);	
				УстановленныеВизы[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ПринятыРешенияПоВышестоящимВизам(ОбъектПроверки
																										, ПараметрУсловия
																										, НаборВизы);
				
				
			ИначеЕсли СтрокаТаблицы.Свойство = "УстановленныеВизы.ПринятоРешениеПоВышестоящимВизам" Тогда	
				
				ПараметрУсловия = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
															,СтрокаТаблицы.ИД
															,"Виза"
															,Справочники.бит_Визы.ПустаяСсылка());
				
				РешениеПроверки = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
															,СтрокаТаблицы.ИД
															,"Решение"
															,Справочники.бит_ВидыРешенийСогласования);

				ОбъектПроверки = ОпределитьОбъектПроверки(СтруктураКонтекст.ТекущийОбъект);
				УстановленныеВизы[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ПринятоРешениеПоВышестоящимВизам(ОбъектПроверки
																										, ПараметрУсловия
																										, РешениеПроверки
																										, НаборВизы);
																										
			Иначе	
				
				Если УстановленныеВизы[СтрокаТаблицы.ИД] = Неопределено Тогда
					
					СтатусКПроверке = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий
																,СтрокаТаблицы.ИД
																,"Статус"
																,Неопределено);
					
					УстановленныеВизы[СтрокаТаблицы.ИД] = бит_ВизированиеСервер.ВизыПолучены(СтруктураКонтекст.ТекущийОбъект.Ссылка
																						,СтатусКПроверке);
					
				КонецЕсли; 
				
			КонецЕсли; // ВсеВизы или конкретный статус
			
		КонецЕсли; // Это установка виз 
		
	КонецЦикла; // По пользовательским условиям
	
	СтруктураКонтекст.Вставить("СостояниеЗадачи"                     , СостояниеЗадачи);
	СтруктураКонтекст.Вставить("ЗадачиПроцесса"                      , ЗадачиПроцесса);
	СтруктураКонтекст.Вставить("ТабЧастьСодержитЗначение"            , ТабЧастьСодержитЗначение);
	СтруктураКонтекст.Вставить("ПозицияСодержитЗначение"             , ПозСодержитЗначение);
	СтруктураКонтекст.Вставить("ПозицияСодержитЗначениеВГруппе"      , ПозСодержитЗначениеВГруппе);
	СтруктураКонтекст.Вставить("СуммаПозиций"                        , СуммаПозиций);
	СтруктураКонтекст.Вставить("УстановленныеВизы"                   , УстановленныеВизы);
	СтруктураКонтекст.Вставить("ДоступнаРольИсполнителя"             , ДоступнаРольИсполнителя);
	СтруктураКонтекст.Вставить("НазначеныИсполнители"                , НазначеныИсполнители);
	СтруктураКонтекст.Вставить("ЕстьКорректировкаКонтрольныхЗначений", ЕстьКорректировкаКонтрольныхЗначений);
	СтруктураКонтекст.Вставить("ВключенаВРеестр"                     , ВключенаВРеестр);
	СтруктураКонтекст.Вставить("РеестрОплачен"                       , РеестрОплачен);
	СтруктураКонтекст.Вставить("РеестрЧастичноОплачен"               , РеестрЧастичноОплачен);
	СтруктураКонтекст.Вставить("ПодключаемыеАлгоритмы"               , ПодключаемыеАлгоритмы);
	СтруктураКонтекст.Вставить("РезультатПроверкиПозиций"            , РезультатПроверкиПозиций);
	
КонецПроцедуры

// Функция выполняет проверку условия подключаемого алгоритма.
//
// Параметры:
//  ПодключаемыйАлгоритм    - СправочникСсылка.ДополнительныеОтчетыИОбработки.
//	ПользовательскоеУсловие - СправочникСсылка.бит_ПользовательскиеУсловия.
//	Контекст                - Структура.
//
// Возвращаемое значение:
//  Булево.
//
Функция РезультатПроверкиУсловияПодключаемогоАлгоритма(ПодключаемыйАлгоритм, ПользовательскоеУсловие, Контекст)
	
	ОбработкаПроверкиАлгоритма = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(ПодключаемыйАлгоритм);
	Если ОбработкаПроверкиАлгоритма = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось получить обработку подключаемого алгоритма ""%1""';
								|en = 'Failed to get processing of the plug-in algorithm ""%1""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодключаемыйАлгоритм);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПроверки = Справочники.бит_ПользовательскиеУсловия.НовыеПараметрыПроверкиПодключаемогоАлгоритма();
	ПараметрыПроверки.ПользовательскоеУсловие = ПользовательскоеУсловие.Ссылка;
	ПараметрыПроверки.ОбъектПроверки          = Контекст.ТекущийОбъект.Ссылка;
	
	Попытка
		РезультатПроверки = ОбработкаПроверкиАлгоритма.РезультатПроверкиПодключаемогоАлгоритма(ПараметрыПроверки);
	Исключение
		ТекстРезультата = НСтр("ru = 'Ошибки в процессе выполнения проверки.';
								|en = 'Errors during the verification process.'") + " "
							+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстРезультата;
	КонецПопытки;
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие, СтруктураКонтекст)
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("КодУсловия"                    , "");
	ПараметрыПроверки.Вставить("УсловиеПодходитТекущемуОбъекту", Истина);
	
	ИсходныйОбъект         = СтруктураКонтекст.ТекущийОбъект;
	ИмяПроверяемогоОбъекта = ИсходныйОбъект.Метаданные().ПолноеИмя();
	
	Если ТипЗнч(ПользовательскоеУсловие) = Тип("СправочникОбъект.бит_ПользовательскиеУсловия") Тогда
		ПараметрыПроверки.КодУсловия = ПользовательскоеУсловие.КодУсловия;
		
		ПроверятьОбъектСистемы = Истина;
		Если бит_ОбщегоНазначения.ЭтоСемействоERP()
			И (ИмяПроверяемогоОбъекта = "Документ.бит_кзн_ПлатежнаяПозиция"
			ИЛИ ИмяПроверяемогоОбъекта = "Документ.бит_кзн_ПозицияПоступления") Тогда
			ПроверятьОбъектСистемы = Ложь;
		Иначе
			Для каждого СтрокаТаблицы Из ПользовательскоеУсловие.Условия Цикл
				Если СтрСравнить(СтрокаТаблицы.Свойство, "Прочее.ДоступнаРольИсполнителя") = 0
					ИЛИ СтрСравнить(СтрокаТаблицы.Свойство, "Прочее.НазначеныИсполнители") = 0 Тогда
					ПроверятьОбъектСистемы = Ложь;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		Если ПроверятьОбъектСистемы Тогда
			ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяПроверяемогоОбъекта);
			Если ПользовательскоеУсловие.ОбъектыСистемы.Найти(ОбъектСистемы, "ОбъектСистемы") = Неопределено Тогда
				ПараметрыПроверки.УсловиеПодходитТекущемуОбъекту = Ложь;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПараметрыПроверкиСсылки = бит_ВизированиеПовтИсп.ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие,
																									ИмяПроверяемогоОбъекта);
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ПараметрыПроверкиСсылки);	
	КонецЕсли;
			
	Возврат ПараметрыПроверки;
	
КонецФункции

Функция ЗначениеПараметраУсловия(ПользовательскоеУсловие, ИдентификаторУсловия)
	
	ИмяПараметра = "Значение";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяПараметра",         ИмяПараметра);
	Отбор.Вставить("ИдентификаторУсловия", ИдентификаторУсловия);
	ЗначенияСписка = ПользовательскоеУсловие.ЗначенияСписковУсловий.НайтиСтроки(Отбор);
	Если ЗначенияСписка.Количество() > 0 Тогда
		ЗначениеПараметра = Новый СписокЗначений;
		Для каждого СтрокаЗначения Из ЗначенияСписка Цикл
			ЗначениеПараметра.Добавить(СтрокаЗначения.Значение);
		КонецЦикла;
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
	Возврат ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий, ИдентификаторУсловия, ИмяПараметра,
									Неопределено);
	
КонецФункции

Функция РезультатУсловияТабЧастьСодержитЗначение(СтрокаУсловия, ПользовательскоеУсловие, СтруктураКонтекст)
	
	ИдентификаторУсловия = СтрокаУсловия.ИД;
	ИмяТабличнойЧасти    = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий, ИдентификаторУсловия,
							"ИмяТабЧасти", "UnrealTable");
	ИмяРеквизита         = ПолучитьПараметрУсловия(ПользовательскоеУсловие.ПараметрыУсловий, ИдентификаторУсловия,
							"ИмяРеквизита", "UnrealAttribute");
	
	ТекущийОбъект     = СтруктураКонтекст.ТекущийОбъект;
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	Если НЕ бит_РаботаСМетаданными.ЕстьТабЧасть(ИмяТабличнойЧасти, МетаданныеОбъекта)
		 И НЕ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ИмяРеквизита, МетаданныеОбъекта, ИмяТабличнойЧасти) Тогда
		 Возврат Ложь;
	КонецЕсли;
	
	ПроверяемоеЗначение  = ЗначениеПараметраУсловия(ПользовательскоеУсловие, ИдентификаторУсловия);
	
	ДанныеТабличнойЧасти = ТекущийОбъект[ИмяТабличнойЧасти].Выгрузить();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
	|	&ПроверяемоеЗначение КАК ПроверяемоеЗначение
	|ПОМЕСТИТЬ ДанныеТабличнойЧасти
	|ИЗ
	|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти";
	ПутьКЗначению = СтрШаблон("ДанныеТабличнойЧасти.%1", ИмяРеквизита);
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, "&ПроверяемоеЗначение", ПутьКЗначению);
	Запрос.Текст  = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", ДанныеТабличнойЧасти);
	Запрос.Выполнить();
	
	ТекстЗапроса =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|ГДЕ
	|	&УсловиеВхождения";
	ВидСравненияУсловия   = СтрокаУсловия.ВидСравнения;
	ТекстУсловияВхождения = "ДанныеТабличнойЧасти.ПроверяемоеЗначение В(&ПроверяемоеЗначение)";
	Если ВидСравненияУсловия = Перечисления.бит_ВидыСравненияТрансляции.ВГруппе
		ИЛИ ВидСравненияУсловия = Перечисления.бит_ВидыСравненияТрансляции.ВГруппеИзСписка Тогда
		ТекстУсловияВхождения = "ДанныеТабличнойЧасти.ПроверяемоеЗначение В ИЕРАРХИИ(&ПроверяемоеЗначение)";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВхождения", ТекстУсловияВхождения);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПроверяемоеЗначение", ПроверяемоеЗначение);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
